package com.gt.controller.exception;

public enum ErrorCodeEnum {
	_CODE_0(0, "操作成功"),
	_CODE_1(-1, "操作失败"),
	_CODE_10000(-10000, "网络错误，请稍后重试"),
	_CODE_10001(-10001, "未登录"),
	_CODE_10002(-10002, "无交易权限"),
	_CODE_10003(-10003, "无提现权限"),
	_CODE_10004(-10004, "IP无权限"),
	_CODE_10005(-10005, "无APP接口权限"),
	_CODE_10006(-10006, "api_key错误"),
	_CODE_10007(-10007, "参数错误"),
	_CODE_10008(-10008, "签名错误"),
	_CODE_10009(-10009, "API不存在"),
	_CODE_10010(-10010, "非法操作"),
	
	
	_CODE_20001(-20001, "暂停注册"),
	_CODE_20002(-20002, "登陆密码长度有误"),
	_CODE_20003(-20003, "手机号码已经被注册"),
	_CODE_20004(-20004, "手机号码格式错误"),
	_CODE_20005(-20005, "短信验证码错误"),
	_CODE_20006(-20006, "邮箱已经存在"),
	_CODE_20007(-20007, "邮箱验证码错误"),
	_CODE_20008(-20008, "邮箱格式错误"),
	_CODE_20009(-20009, "请填写正确的邀请码"),
	_CODE_20010(-20010, "用户名错误"),
	_CODE_20011(-20011, "用户名不存在"),
	_CODE_20012(-20012, "系统升级中，暂停登录"),
	_CODE_20013(-20013, "用户被禁用"),
	_CODE_20014(-20014, "用户名或密码错误"),
	_CODE_20015(-20015, "此ip操作频繁，请2小时后再试!"),
	_CODE_20016(-20016, "短信类型错误"),
	_CODE_20017(-20017, "邮箱不存在"),
	_CODE_20018(-20018, "请登录后继续操作"),
	_CODE_20019(-20019, "请先进行实名认证"),
	_CODE_20020(-20020, "该账户不存在"),
	_CODE_20021(-20021, "请绑定手机号码"),
	_CODE_20022(-20022, "请绑定邮箱"),
	_CODE_20023(-20023, "行为验证失败"),
	_CODE_20024(-20024, "修改安全设置的48小时之内，不允许进行提现提币等资金操作"),
	_CODE_20025(-20025, "请先设置交易密码"),
	_CODE_20026(-20026, "交易密码有误"),
	_CODE_20027(-20027, "请先绑定手机号码或者GOOGLE验证码"),
	_CODE_20028(-20028, "谷歌验证码有误"),
	_CODE_20029(-20029, "手机验证码有误"),
	_CODE_20030(-20030, "系统参数未配置，请联系管理员"),
	_CODE_20031(-20031, "项目方不允许划转操作"),
	_CODE_20032(-20032, "系统账户不存在，请联系管理员"),
	_CODE_20033(-20033, "系统账户余额不足"),
	_CODE_20034(-20034, "用户账户余额不足"),
	_CODE_20035(-20035, "地址库地址不足，请联系管理员"),
	_CODE_20036(-20036, "该虚拟币不支持充值"),
	_CODE_20037(-20037, "市场不存在或被禁用"),
	_CODE_20038(-20038, "现在不是交易时间"),
	_CODE_20039(-20039, "低于最小交易数量"),
	_CODE_20040(-20040, "超过最大交易数量"),
	_CODE_20041(-20041, "低于最小挂单价格"),
	_CODE_20042(-20042, "高于最大挂单价格"),
	_CODE_20043(-20043, "低于最小挂单金额"),
	_CODE_20044(-20044, "高于最大挂单金额"),
	_CODE_20045(-20045, "挂单价格不能高于涨停价"),
	_CODE_20046(-20046, "挂单价格不能低于跌停价"),
	_CODE_20047(-20047, "账户余额不足");

    private int code;
    private String msg;

    private ErrorCodeEnum(int code, String msg) {
        this.setCode(code);
        this.setMsg(msg);
    }


    public int getCode() {
		return code;
	}


	public void setCode(int code) {
		this.code = code;
	}


	public String getMsg() {
		return msg;
	}


	public void setMsg(String msg) {
		this.msg = msg;
	}

	@Override
    public String toString() {
        return "[" + this.code + "]" + this.msg;
    }
}
